In [23]:
import pandas as pd
import numpy as np

In [33]:
df = pd.read_csv('Uncleaned_employees_final_dataset.csv')

In [34]:
df.head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met_more_than_80,awards_won,avg_training_score
0,8724,Technology,region_26,Bachelors,m,sourcing,1,24,NaN,1,1,0,77
1,74430,HR,region_4,Bachelors,f,other,1,31,3.0,5,0,0,51
2,72255,Sales & Marketing,region_13,Bachelors,m,other,1,31,1.0,4,0,0,47
3,38562,Procurement,region_2,Bachelors,f,other,3,31,2.0,9,0,0,65
4,64486,Finance,region_29,Bachelors,m,sourcing,1,30,4.0,7,0,0,61

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17417 entries, 0 to 17416
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   employee_id            17417 non-null  int64
 1   department             17417 non-null  object
 2   region                 17417 non-null  object
 3   education              16646 non-null  object
 4   gender                 17417 non-null  object
 5   recruitment_channel    17417 non-null  object
 6   no_of_trainings        17417 non-null  int64
 7   age                    17417 non-null  int64
 8   previous_year_rating   16054 non-null  float64
 9   length_of_service      17417 non-null  int64
 10  KPIs_met_more_than_80  17417 non-null  int64
 11  awards_won             17417 non-null  int64
 12  avg_training_score     17417 non-null  int64
dtypes: float64(1), int64(7), object(5)
memory usage: 1.7+ MB

In [36]:
df.shape

(17417, 13)

In [37]:
df = df.drop_duplicates()

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17415 entries, 0 to 17416
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   employee_id            17415 non-null  int64
 1   department             17415 non-null  object
 2   region                 17415 non-null  object
 3   education              16644 non-null  object
 4   gender                 17415 non-null  object
 5   recruitment_channel    17415 non-null  object
 6   no_of_trainings        17415 non-null  int64
 7   age                    17415 non-null  int64
 8   previous_year_rating   16052 non-null  float64
 9   length_of_service      17415 non-null  int64
 10  KPIs_met_more_than_80  17415 non-null  int64
 11  awards_won             17415 non-null  int64
 12  avg_training_score     17415 non-null  int64
dtypes: float64(1), int64(7), object(5)
memory usage: 1.9+ MB

In [39]:
df.isnull().sum()

employee_id                 0
department                  0
region                      0
education                 771
gender                      0
recruitment_channel         0
no_of_trainings             0
age                         0
previous_year_rating     1363
length_of_service           0
KPIs_met_more_than_80       0
awards_won                  0
avg_training_score          0
dtype: int64

In [40]:
df = df.dropna(subset=['previous_year_rating'])

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16052 entries, 1 to 17416
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   employee_id            16052 non-null  int64
 1   department             16052 non-null  object
 2   region                 16052 non-null  object
 3   education              15422 non-null  object
 4   gender                 16052 non-null  object
 5   recruitment_channel    16052 non-null  object
 6   no_of_trainings        16052 non-null  int64
 7   age                    16052 non-null  int64
 8   previous_year_rating   16052 non-null  float64
 9   length_of_service      16052 non-null  int64
 10  KPIs_met_more_than_80  16052 non-null  int64
 11  awards_won             16052 non-null  int64
 12  avg_training_score     16052 non-null  int64
dtypes: float64(1), int64(7), object(5)
memory usage: 1.7+ MB

In [42]:
df = df.dropna(subset=['education'])

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15422 entries, 1 to 17416
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   employee_id            15422 non-null  int64
 1   department             15422 non-null  object
 2   region                 15422 non-null  object
 3   education              15422 non-null  object
 4   gender                 15422 non-null  object
 5   recruitment_channel    15422 non-null  object
 6   no_of_trainings        15422 non-null  int64
 7   age                    15422 non-null  int64
 8   previous_year_rating   15422 non-null  float64
 9   length_of_service      15422 non-null  int64
 10  KPIs_met_more_than_80  15422 non-null  int64
 11  awards_won             15422 non-null  int64
 12  avg_training_score     15422 non-null  int64
dtypes: float64(1), int64(7), object(5)
memory usage: 1.6+ MB

In [44]:
df.shape

(15422, 13)

In [45]:
df.columns

Index(['employee_id', 'department', 'region', 'education', 'gender',
       'recruitment_channel', 'no_of_trainings', 'age', 'previous_year_rating',
       'length_of_service', 'KPIs_met_more_than_80', 'awards_won',
       'avg_training_score'],
      dtype='object')

In [46]:
df['region'] = df['region'].str.extract(r'(\D*)(\d+$)')[1]

In [48]:
df.head(10)

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met_more_than_80,awards_won,avg_training_score
1,74430,HR,4,Bachelors,f,other,1,31,3.0,5,0,0,51
2,72255,Sales & Marketing,13,Bachelors,m,other,1,31,1.0,4,0,0,47
3,38562,Procurement,2,Bachelors,f,other,3,31,2.0,9,0,0,65
4,64486,Finance,29,Bachelors,m,sourcing,1,30,4.0,7,0,0,61
5,46232,Procurement,7,Bachelors,m,sourcing,1,36,3.0,2,0,0,68
6,54542,Finance,2,Bachelors,m,other,1,33,5.0,3,1,0,57
7,67269,Analytics,22,Bachelors,m,sourcing,2,36,3.0,3,0,0,85
8,66174,Technology,7,Masters & above,m,other,1,51,4.0,11,0,0,75
9,76303,Technology,22,Bachelors,m,sourcing,1,29,5.0,2,1,0,76
10,60245,Sales & Marketing,16,Bachelors,m,sourcing,2,40,5.0,12,1,0,50

In [49]:
df.to_csv('cleaned_data.csv', encoding='utf-8', index=False)

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15422 entries, 1 to 17416
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   employee_id            15422 non-null  int64
 1   department             15422 non-null  object
 2   region                 15422 non-null  object
 3   education              15422 non-null  object
 4   gender                 15422 non-null  object
 5   recruitment_channel    15422 non-null  object
 6   no_of_trainings        15422 non-null  int64
 7   age                    15422 non-null  int64
 8   previous_year_rating   15422 non-null  float64
 9   length_of_service      15422 non-null  int64
 10  KPIs_met_more_than_80  15422 non-null  int64
 11  awards_won             15422 non-null  int64
 12  avg_training_score     15422 non-null  int64
dtypes: float64(1), int64(7), object(5)
memory usage: 1.6+ MB

In [52]:
df.shape

(15422, 13)